Repository: losnoco/Cog
Catalog: Preferences/Preferences/*.lproj/Preferences.strings
Languages: es, pl, ru, tr

# 61.title
source: OtherViews
es: Otras vistas
ru: Другие виды
tr: DiğerGörünümler

# 62.title
source: Item1
tr: Öğe1

# 63.title
source: Item2
tr: Öğe2

# 64.title
source: Item3
tr: Öğe3

# 198.title
source: Play:
es: Reproducir:
ru: Воспроизведение:
tr: Oynat:

# 199.title
source: Previous:
es: Anterior:
ru: Предыдущий:
tr: Önceki:

# 200.title
source: Next:
es: Siguiente:
ru: Следующий:
tr: İleri:

# 211.title
source: Output Device:
es: Dispositivo de salida:
ru: Устройство воспроизведения:
tr: Çıkış Cihazı:

# 249.title
source: OtherViews
es: Otras vistas
ru: Другие Виды
tr: DiğerGörünümler

# 250.title
source: Item 1
tr: Öğe 1

# 251.title
source: Item 2
tr: Öğe 2

# 252.title
source: Item 3
tr: Öğe 3

# 255.title
source: OtherViews
es: Otras vistas
pl: rzecz 2
ru: Другие Виды
tr: DiğerGörünümler

# 256.title
source: Item 1
tr: Öğe 1

# 257.title
source: Item 2
tr: Öğe 2

# 258.title
source: Item 3
tr: Öğe 3

# 260.title
source: When opening files:
es: Al abrir archivos:
ru: При открытии файлов:
tr: Dosyaları açarken:

# 262.title
source: When opening file with ⇧ or ⌃⌘ held:
es: Al abrir archivos con las teclas ⇧ o ⌃⌘:
pl: gdy otwierasz plik z trzymanym ⇧ albo ⌃⌘:
ru: При открытии файла с удержанием ⇧ или ⌃⌘:
tr: Dosya ⇧ veya ⌃⌘ basılıyken açılırken:

# 311.title
source: Read CUE sheets when adding folders to playlist
es: Leer las hojas CUE al añadir carpetas a la lista de reproducción
pl: odczytywanie arkusze CUE podczas dodawania folderów do listy odtwarzania
ru: Читать листы CUE при добавлении папок в плейлист
tr: Çalma listesine klasör eklerken CUE sayfalarını okuma

# 1Cb-TU-E0q.title
source: Item 3
tr: Öğe 3

# 1Yq-6f-Uho.title
source: Item 2
tr: Öğe 2

# 1y7-iZ-BhE.title
source: Reset to defaults
es: Volver a valores por defecto
pl: zresetuj do domyślnych ustawień
ru: Сбросить по умолчанию
tr: Varsayılanlara sıfırla

# 3Gx-cs-3B0.title
source: Item 1
pl: rzecz 1
tr: Öğe 1

# 7un-em-D8r.title
source: Table View Cell
es: Celda de vista de tabla
pl: rzecz 3
tr: Tablo Görünümü Hücresi

# 99B-Tx-dPH.title
source: Item 2
tr: Öğe 2

# A9I-fr-vHp.title
source: Sample rate:
es: Tasa de muestreo:
ru: Частота дискретизации:
tr: Örnekleme hızı:

# AQZ-ku-F8u.title
source: Default play time:
es: Tiempo de reproducción:
ru: Время воспроизведения по умолчанию:
tr: Varsayılan çalma süresi:

# Bll-IJ-lje.title
source: Spectrum bars
es: Barras del analizador
ru: Панели спектра
tr: Spektrum çubukları

# CQI-YZ-B3V.title
source: Spectrum peaks
es: Picos del analizador
pl: szczyty spektrum
ru: Пики спектра
tr: Spektrum pikleri

# Dhd-k8-ZXq.title
source: Text Cell
es: Celda de texto
tr: Metin Hücresi

# ECB-P0-pve.title
source: Label
ru: Метка
tr: Etiket

# EQX-aL-uT0.title
source: Item 3
tr: Öğe 3

# Fgm-Vs-tgU.title
source: Default loop count:
es: Bucles por defecto:
ru: Количество циклов по умолчанию:
tr: Varsayılan döngü sayısı:

# GdX-5e-NeU.title
source: Colorful dock icons
es: Colorear icono del dock
pl: kolorowe ikony Dock
ru: Цветные иконки в dock
tr: Renkli dock simgeleri

# HKM-FW-dhH.title
source: OtherViews
es: Otras vistas
ru: Другие Виды
tr: DiğerGörünümler

# JU5-o7-jid.title
source: Delete Invalid Paths
es: Eliminar rutas inválidas
pl: usuń nieprawidłowe ścieżki
ru: Удалить Неверные Пути
tr: Geçersiz Yolları Sil

# JxP-0t-mTB.title
source: Add Path
es: Agregar ruta
pl: dodać ścieżkę
ru: Добавить Путь
tr: Yol Ekle

# KJz-qS-IcO.title
source: Selected:
es: Seleccionado:
ru: Выбрано:
tr: Seçili:

# LwT-Qb-47r.title
source: Table View Cell
es: Celda de vista de tabla
pl: widok komurki tabeli
tr: Tablo Görünümü Hücresi

# NGx-0c-WVR.title
source: Enable HRTF filter (Not needed with AirPods or Beats)
es: Activar filtro HRTF (no es necesario con AirPods o Beats)
ru: Включить фильтр HRTF (не требуется с AirPods или Beats)
tr: HRTF filtresini etkinleştir (Airpods veya Beats ile gerekli değildir)

# NMg-TO-amV.title
source: Use 3D rendered spectrum
es: Usar analizador en tres dimensiones
ru: Использовать 3D-рендеринг спектра
tr: 3D işlenmiş spektrum kullanın

# POG-ai-6D2.title
source: (will be preferred if possible)
es: (se usará si es posible)
ru: (будет предпочтительнее, если это возможно)
tr: (mümkünse tercih edilecektir)

# RGf-4D-3NW.title
source: Show album art
es: Mostrar carátula del álbum
pl: pokaż okładkę albumu
ru: Показать обложку альбома
tr: Albüm kapağını göster

# SBA-J5-rEd.title
source: Quit when playback completes
es: Salir al terminar reproducción
pl: wyłącz aplikacje, gdy odtwarzanie się zakończy
ru: Выйти после завершения воспроизведения
tr: Oynatma tamamlandığında çık

# SMd-GA-jrH.title
source: Spam:
ru: Спам:
tr: Copy now playing:

# UdW-qd-A0x.title
source: Default fade time:
es: Tiempo de fundido:
ru: Время затухания по умолчанию:
tr: Varsayılan solma süresi:

# V8o-Xy-HUW.title
source: OtherViews
es: Otras vistas
pl: rzecz 1
ru: Другие Виды
tr: DiğerGörünümler

# WWy-iW-3Ct.title
source: Item 3
pl: rzecz 3
tr: Öğe 3

# XzK-h2-vIT.title
source: Item 1
pl: rzecz 1
tr: Öğe 1

# YLi-QX-EgD.title
source: Item 2
tr: Öğe 2

# Yz2-Ee-bZ0.headerCell.title
source: Path
es: Ruta
pl: ścieżka
ru: Путь
tr: Yol

# bWQ-dT-X3w.title
source: Text Cell
es: Celda de texto
pl: komurka z tekstem
tr: Metin Hücresi

# cOb-hQ-7K8.title
source: Use iTunes style
es: Usar estilo de iTunes
ru: Использовать стиль iTunes
tr: iTunes stilini kullan

# ds2-aw-ebU.title
source: Limit volume control to 100%
es: Limitar el control de volumen al 100%
ru: Ограничить громкость до 100%
tr: Ses kontrolünü %100 ile sınırlayın

# eX0-PC-iVo.title
source: Resampling Quality:
es: Calidad del remuestreo:
ru: Качество ресемплинга:
tr: Yeniden Örnekleme Kalitesi:

# fUg-Cg-gXa.title
source: Resume playback on startup
es: Resumir reproducción al abrir
ru: Возобновление воспроизведения при запуск
tr: Başlangıçta oynatmayı sürdür

# gXL-j6-df0.title
source: Use flat perspective in toolbar
es: Usar perspectiva plana en el analizador de la barra de herramientas
ru: Использовать плоскую перспективу на панели инструментов
tr: Spektrum 2D görünüm

# hqT-nY-NoU.title
source: Enable notifications
es: Habilitar notificaciones
ru: Включить уведомления
tr: Bildirimleri etkinleştir

# jLL-zc-kYf.title
source: Item 3
tr: Öğe 3

# klv-Wh-0ur.title
source: hh:mm:ss.ms
tr: ss:dd:ss.ms

# lEg-E3-TBs.headerCell.title
source: Valid
es: Válida
pl: działające
ru: Действительный
tr: Geçerli

# n5F-dq-NZh.title
source: MIDI Plugin:
es: Componente MIDI:
ru: MIDI Плагин:
tr: MIDI eklentisi:

# nva-pz-xSS.title
source: Delete Path
es: Eliminar ruta
pl: usunąć ścieżkę
ru: Удалить Путь
tr: Yolu Sil

# nzS-3F-jPX.title
source: Item 2
tr: Öğe 2

# oWh-lD-mFH.title
source: Item 1
tr: Öğe 1

# qjI-dK-nfG.title
source: Suggest Paths
es: Sugerir rutas
pl: zasugeruj ścieżki
ru: Предложить Пути
tr: Yol Öner

# sva-DV-ina.title
source: Allow insecure SSL connections
es: Permitir conexiones inseguras SSL
pl: zezwalaj na niezabezpieczone połączenia SSL
ru: Разрешить небезопасные соединения SSL
tr: Güvenli olmayan SSL bağlantılarına izin ver

# vMI-lj-Lrz.title
source: Show stop button
es: Mostrar botón "Detener"
pl: pokaż przycisk pałzy
ru: Показать кнопку стоп
tr: Durdur düğmesini göster

# vaQ-pZ-jXy.title
source: Item 1
tr: Öğe 1

# wK4-EF-8Wa.title
source: Volume Level:
es: Nivel de volumen:
pl: poziom głośności:
ru: Уровень громкости:
tr: Ses Düzeyi:

# wNb-bg-cgq.ibShadowedIsNilPlaceholder
source: None
es: Ninguna
pl: brak
ru: Нет
tr: Hiçbiri

# wWm-AD-cD4.title
source: Folder access paths:
es: Rutas de acceso a carpetas:
pl: ścieżki dostępu do folderó:
ru: Пути доступа к папкам:
tr: Klasör erişim yolları:

# yeL-9c-lFq.title
source: Select a SoundFont
es: Elige una SoundFont
pl: wybież sound font
ru: Выбрать SoundFont
tr: Bir Soundfont seçin

# zQ2-6O-3Og.title
source: Send crash reports and usage data
es: Enviar informes de fallas y datos de uso
pl: wysyłaj raporty awarji i dane użycia
ru: Отправлять отчеты о сбоях и данные об использовании
tr: Kilitlenme raporlarını ve kullanım verilerini gönderme

# zaI-0m-tQf.title
source: hh:mm:ss.ms
tr: ss:dd:ss.ms

# FQF-vJ-hBx.title
source: MIDI Flavor:
es: Variedad de MIDI:
pl: odmiana midi:
ru: MIDI особенность:

# 207.title
source: Automatically check for updates on startup
es: Buscar actualizaciones al abrir
