Repository: losnoco/Cog
Catalog: *.lproj/Localizable.strings
Languages: ru, tr

# AddButtonTooltip
source: Add files
ru: Добавить файлы
tr: Dosya ekle

# ConsentNo
source: No
ru: Нет
tr: Hayır

# ConsentYes
source: Yes
ru: Да
tr: Evet

# CrashlyticsConsentText
source: Would you like to allow Crashlytics to submit crash reports? You may turn this off again in Preferences. We won't ask you again.
ru: Разрешить Crashlytics отправлять отчеты о сбоях? Вы можете снова отключить это в настройках. Мы не будем спрашивать вас снова.
tr: Crashlytics'in çökme raporu göndermesine izin vermek ister misiniz? Bunu Tercihler'den tekrar kapatabilirsiniz. Size tekrar sormayacağız.

# CrashlyticsConsentTitle
source: Crashlytics crash collection
ru: Коллекция сбоев Crashlytics
tr: Crashlytics çökme koleksiyonu

# ErrorInvalidTrackId
source: Invalid track ID sent to SQLite request.
ru: Недопустимый ID дорожки отправлен в запрос SQLite.
tr: SQLite isteğine geçersiz parça kimliği gönderildi.

# ErrorMessageBadFile
source: Unable to parse metadata for bad file.
ru: Невозможно проанализировать метаданные для плохого файла.
tr: Hatalı dosya için meta veriler ayrıştırılamıyor.

# ErrorMetadata
source: Unable to retrieve metadata.
ru: Не удалось получить метаданные.
tr: Meta veriler alınamıyor.

# ErrorSqliteProblem
source: General problem accessing track from SQLite database.
ru: Общая проблема с доступом к треку из базы данных SQLite.
tr: SQLite veritabanından parçaya erişimde genel sorun.

# ErrorTrackMissing
source: Track entry is missing from SQLite database.
ru: Запись дорожки отсутствует в базе данных SQLite.
tr: SQLite veritabanında parça girişi eksik.

# ErrorTrackTooltip
source: Error
ru: Ошибка
tr: Hata

# FeedbackFailedInformativeText
source: Feedback failed to send.
ru: Не удалось отправить сообщение обратной связи.
tr: Geri bildirim gönderilemedi.

# FeedbackFailedMessageText
source: Failed
ru: Не удалось
tr: Başarısız

# FeedbackSuccessInformativeText
source: Feedback successfully sent!
ru: Сообщение обратной связи успешно отправлено!
tr: Geri bildirim başarıyla gönderildi!

# FeedbackSuccessMessageText
source: Success
ru: Успешно
tr: Başarı

# FileButtonTooltip
source: File drawer
ru: Файлы
tr: Dosya çekmecesi

# GainAlbumGain
source: Album Gain
ru: Усиление в Альбоме
tr: Albüm Kazancı

# GainAlbumGainPeak
source: Album Gain plus Peak
ru: Усилиение в Альбоме плюс Пик
tr: Albüm Kazancı artı Pik

# GainAlbumPeak
source: Album Peak
ru: Пик в Альбоме
tr: Albüm Piki

# GainNone
source: None
ru: Нет
tr: Hiçbiri

# GainTrackGain
source: Track Gain
ru: Усиление Трека
tr: Parça Kazancı

# GainTrackGainPeak
source: Track Gain plus Peak
ru: Усиление Трека плюс Пик
tr: Parça Kazancı artı Pik

# GainTrackPeak
source: Track Peak
ru: Пик Трека
tr: Parça Piki

# GainVolumeScale
source: Volume Scale
ru: Шкала Громкости
tr: Ses Düzeyi

# InfoButtonTooltip
source: Information on the selected file
ru: Информация о выбранных файлах
tr: Seçili dosya hakkında bilgi

# InvalidURLLong
source: The URL is not valid.
ru: Этот URL некорректный.
tr: URL geçerli değil.

# InvalidURLShort
source: Invalid URL
ru: Некорректный URL
tr: Geçersiz URL

# NextButtonTooltip
source: Next
ru: Следующий
tr: Sonraki

# PauseButtonTooltip
source: Pause
tr: Duraklat

# PlayButtonTooltip
source: Play
ru: Воспроизвести
tr: Oynat

# PlayingTrackTooltip
source: Playing
ru: Воспроизводится
tr: Çalıyor

# PlaylistHeaderContextMenuTitle
source: Playlist Header Context Menu
ru: Контекстное меню заголовка плейлиста
tr: Çalma Listesi Başlığı İçerik Menüsü

# PlaylistIndexColumn
source: Index
ru: Индекс
tr: Indeks

# PlaylistRandomizationAction
source: Playlist Randomization
ru: Премещать Плейлист
tr: Çalma listesi rastgeleleştirmesi

# PlaylistStatusColumn
source: Status
ru: Статус
tr: Durum

# PreferencesTitle
source: Preferences
ru: Настройки
tr: Tercihler

# PrevButtonTooltip
source: Previous
ru: Предыдущий
tr: Önceki

# ProgressActionLoader
source: playlist loader inserting files
ru: загрузчик плейлистов вставляет файлы
tr: çalma listesi yükleyicisi dosya ekleme

# ProgressActionLoadingMetadata
source: loading metadata for tracks
ru: загрузка метаданных для треков
tr: parçalar için meta verileri yükleme

# ProgressSubActionLoaderAddingEntries
source: creating and adding playlist entries
ru: создание и добавление записей в список воспроизведения
tr: çalma listesi girişleri oluşturma ve ekleme

# ProgressSubActionLoaderFilteringContainedFiles
source: eliminating unsupported file types from containers
ru: удаление неподдерживаемых типов файлов из контейнеров
tr: desteklenmeyen dosya türlerini kapsayıcılardan kaldırma

# ProgressSubActionLoaderFilteringContainerFiles
source: handling container file types
ru: обработка типов файлов-контейнеров
tr: kapsayıcı dosya türlerini işleme

# ProgressSubActionLoaderFilteringFiles
source: eliminating unsupported file types
ru: устранение неподдерживаемых типов файлов
tr: desteklenmeyen dosya türlerini kaldırma

# ProgressSubActionLoaderListingFiles
source: collecting files
ru: сбор файлов
tr: dosyaları toplama

# ProgressSubActionLoadingMetadata
source: processing files
ru: обработка файлов
tr: dosyaları işleme

# ProgressSubActionMetadataApply
source: applying info to playlist storage
ru: применение информации в хранилище плейлистов
tr: çalma listesi deposuna bilgi uygulama

# QueuedTrackTooltip
source: Queued
ru: В очереди
tr: Sıraya alındı

# RandomizeButtonTooltip
source: Randomize playlist
ru: Перемешать плейлист
tr: Çalma listesini rastgele seç

# RemoveButtonTooltip
source: Remove selected files
ru: Удалить выбраные файлы
tr: Seçili dosyaları kaldır

# RepeatButtonTooltip
source: Repeat mode
ru: Режим повтора
tr: Tekrar modu

# ShuffleButtonTooltip
source: Shuffle mode
ru: Случайный режим
tr: Karıştırma modu

# SkipAction
source: Skip
ru: Пропустить
tr: Atla

# StopAfterTrackTooltip
source: Stop After Track
ru: Остановить После трека
tr: Parçadan sonra dur

# StopButtonTooltip
source: Stop
ru: Остановить
tr: Durdur

source: Switch from Mini Player
ru: Переключить из Мини Плеера
tr: Mini oynatıcıdan geç

source: Switch to Mini Player
ru: Переключить в Мини Плеер
tr: Mini oynatıcıya geç

# TimeFirstSeen
source: First seen
ru: Первое увиденное
tr: İlk görülme

# TimeLastPlayed
source: Last played
ru: Последнее проигрываемое
tr: Son çalınan

# Version %@ (%@)
source: Version %1$@ (%2$@)
tr: Sürüm %1$@ (%2$@)

source: %1d seconds(s)
tr: %1d saniye

source: Total duration: %@
ru: Общая продолжительность: %@
tr: Toplam süre: %@

# ms
source: %@ and %@
ru: %@ и %@
tr: %@ ve %@

# hms
source: %@, %@ and %@
ru: %@, %@ и %@
tr: %@, %@ ve %@

# dhms
source: %@, %@, %@ and %@
ru: %@, %@, %@ и %@
tr: %@, %@, %@ ve %@

# wdhms
source: %@, %@, %@, %@ and %@
ru: %@, %@, %@, %@ и %@
tr: %@, %@, %@, %@ ve %@

# GrantPathTitle
source: Open to grant access to container folder
tr: Konteyner klasörüne erişim izni vermek için aç

# GrantPathMessage
source: Click OK on the following folder open dialog to grant access to the specified folder. Navigate the dialog further up the folder hierarchy to grant broader access to your files. Press 'Stop warning me' to hide any further warnings for the rest of the session.
tr: Belirtilen klasöre erişim izni vermek için aşağıdaki klasör açma iletişim kutusunda Tamam'a tıklayın. Dosyalarınıza daha geniş erişim izni vermek için iletişim kutusunda klasör hiyerarşisinde daha yukarı doğru gidin. Oturumun geri kalanında başka uyarıları gizlemek için "Beni uyarmayı bırak" seçeneğine basın.

# GrantPathOK
source: OK
tr: Tamam

# GrantPathStopWarning
source: Stop warning me
tr: Beni uyarmayı durdur
